
[NONE]
ID_Description=NONE
ID_NAME=NONE
[ASSAULT]
ID_NAME=Assault Rifles
[LMG]
ID_NAME=Light Machine Guns
[MACHINEPISTOLS]
ID_NAME=Machine Pistols
[PISTOLS]
ID_NAME=Pistols
[SHOTGUN]
ID_NAME=Shotguns
[SNIPER]
ID_NAME=Sniper Rifles
[SUBGUN]
ID_NAME=Submachine Guns
[Pistol92FS]
ID_Description=The 9mm 92FS Pistol is RAINBOW's 9mm pistol of choice. Its primary advantages are low recoil and a large magazine compared to the bulkier .45cal.
ID_NAME=92FS (9mm)
ID_SHORTNAME=92FS
[PistolUSP]
ID_Description=The 0.40cal USP Pistol is a favorite among those desiring a balance between weapon size and firepower.
ID_NAME=USP (.40cal)
ID_SHORTNAME=USP
[PistolMk23]
ID_Description=The extreme ruggedness, reliability and match-grade accuracy of the .45 Caliber Mark ACP has made it handgun of choice for western Special Forces.  A specially designed sound and flash suppressor virtually eliminates muzzle flash and provides more than 35dB of sound reduction. It is an essential part of any RAINBOW mission requiring both firepower and discretion.
ID_NAME=Mk23 (.45cal)
ID_SHORTNAME=Mk23
[PistolDesertEagle50]
ID_Description=The 0.50cal Desert Eagle Pistol is a very powerful handgun. It is capable of punching through body armor, but has a limited seven-round magazine.
ID_NAME=Desert Eagle (.50cal)
ID_SHORTNAME=D. Eagle .50
[PistolDesertEagle357]
ID_Description=The smaller cousin of the 0.50cal Desert Eagle Pistol, the 0.357cal Desert Eagle Pistol round packs a punch capable of punching through body armor at close range. It carries a limited nine-round magazine.
ID_NAME=Desert Eagle (.357cal)
ID_SHORTNAME=D. Eagle .357
[PistolAPArmy]
ID_Description=The AP Army was designed as an Army pistol with high armor-piercing capabilities. Low recoil and high magazine capacity makes this handgun a good defensive firearm against personnel in bulletproof jackets or in unarmored vehicles.
ID_NAME=AP Army (5.7mm)
ID_SHORTNAME=AP Army
[PistolP228]
ID_Description=In addition of being one of RAINBOW’s favorites, it’s also a popular law enforcement handgun used by many police departments throughout the world.
ID_NAME=P-228 (9mm)
ID_SHORTNAME=P228
[PistolSPP]
ID_Description=First appearing in 1989, the 9mm SPP Pistol is bigger and heavier than most pistols, but it's a little more precise. This makes it a great option for RAINBOW's operatives.
ID_NAME=SPP (9mm)
ID_SHORTNAME=SPP
[PistolCZ61]
ID_Description=The CZ-61 Skorpion machine pistol is a dual-purpose weapon, intended for both close combat and personal defense. Its small size makes this weapon very suitable for concealed carry or for use in confined spaces, such as cars or aircraft. This gun became popular with police, security and counter-terrorist units, as well as some terrorist organizations.
ID_NAME=CZ-61 (7.65mm)
ID_SHORTNAME=CZ-61
[PistolMac119]
ID_Description=The Mac 11/9 machine pistol was developed around 1970 when Special Forces and police units adopted it. Its high rate of fire and small size make it ideal for close combat.
ID_NAME=Mac 11/9 (9mm)
ID_SHORTNAME=Mac11/9
[PistolMicroUzi]
ID_Description=The Micro-UZI was developed as a personal defense weapon. Police and military of more than 90 countries have adopted this weapon due to its compact size and reliability.
ID_NAME=Micro-Uzi (9mm)
ID_SHORTNAME=Micro-Uzi
[PistolSR2]
ID_Description=The SR-2 is a modern machine pistol currently in use with Special Forces.  Its special 9x21mm Gurza ammunition is sufficiently powerful to penetrate most forms of body armor.
ID_NAME=SR-2 (9mm)
ID_SHORTNAME=SR-2
[SubMP5A4]
ID_Description=The preferred submachine gun of counter-terrorist operatives around the world, the 9mm MP5A4 SMG is known for its reliability and accuracy, even when firing on full automatic.
ID_NAME=MP5A4 (9mm)
ID_SHORTNAME=MP5A4
[SubMP5SD5]
ID_Description=Terrorists throughout the world fear the 9mm MP5SD5 SMG. Its integral silencer is so effective that the report of the bullet is miniscule compared to the click of the bolt operating. RAINBOW uses the 9mm MP5SD5 whenever both accuracy and stealth are essential.
ID_NAME=MP5SD5 (9mm)
ID_SHORTNAME=MP5SD5
[SubMP5KPDW]
ID_Description=The 9mm MP5K PDW SMG is a compact version of the classic MP5. Its folding stock and low weight make it an ideal choice when a full rifle or submachine gun would be unmanageable.
ID_NAME=MP5K PDW (9mm)
ID_SHORTNAME=MP5K PDW
[SubMP510A2]
ID_Description=The MP5 10A2 SMG is a basically an MP5 chambered for a 10mm round. The increased stopping power of the heavier round is offset by increased recoil.
ID_NAME=MP5/10A2 (10mm)
ID_SHORTNAME=MP5/10A2
[SubUMP]
ID_Description=The UMP is a .45cal SMG roughly based on the MP5. The stopping power of its round comes at the price of an increased recoil and lower rate of fire.
ID_NAME=UMP (.45cal)
ID_SHORTNAME=UMP
[SubM12S]
ID_Description=The 9mm M12 SMG is a recoil operated, select-fire weapon, firing from an open bolt. It has a low rate of fire compared to other SMGs and is a little less accurate, but its small size and weight make up for it.
ID_NAME=M12 (9mm)
ID_SHORTNAME=M12S
[SubP90]
ID_Description=The 5.7mm P90 SMG is a blowback operated, select-fire weapon. It is fed from 50-round box magazines located on top of the weapon and made from translucent polymer. It was developed in the late 1980s and may be referred to as a forerunner of the PDW (Personal Defense Weapon) concept.
ID_NAME=P90 (5.7mm)
ID_SHORTNAME=P90
[SubTMP]
ID_Description=The 9mm TMP is a modern compact SMG. It uses a blowback operated, locked breech design with a rotating barrel. The TMP is reported to be a very controllable and comfortable weapon to fire.
ID_NAME=TMP (9mm)
ID_SHORTNAME=TMP
[SubUzi]
ID_Description=The UZI is manufactured in several countries and is the primary submachine gun of several of the world's military. The overall ruggedness and relative simplicity of the UZI have given it a reputation as a very reliable weapon, capable of operating under the severest conditions.
ID_NAME=Uzi (9mm)
ID_SHORTNAME=Uzi
[SubCZ61]
ID_Description=The CZ-61 Skorpion machine pistol is a dual-purpose weapon, intended for both close combat and personal defense. Its small size makes this weapon very suitable for concealed carry or for use in confined spaces, such as cars or aircraft. This gun is popular with police, security and counter-terrorist units, as well as some terrorist organizations.
ID_NAME=CZ-61 (7.65mm)
ID_SHORTNAME=CZ-61
[SubMTAR21]
ID_Description=The TAR-21 is an extremely modern bullpup design and is offered in four configurations. The MTAR-21 specially configured for commando, airborne, paratroopers and special rescue units.
ID_NAME=MTAR-21 (9mm)
ID_SHORTNAME=MTAR-21
[SubMac119]
ID_Description=The Mac 11/9 machine pistol was developed around 1970 when Special Forces and police units adopted it.  Its high rate of fire and small size make it ideal for close combat.
ID_NAME=Mac 11/9 (9mm)
ID_SHORTNAME=Mac11/9
[SubMicroUzi]
ID_Description=The Micro-UZI was developed as a personal defense weapon. Police and military of more than 90 countries have adopted this weapon due to its compact size and reliability.
ID_NAME=Micro-Uzi (9mm)
ID_SHORTNAME=Micro-Uzi
[SubSR2]
ID_Description=The SR-2 is a modern machine pistol currently in use with Special Forces.  Its special 9x21mm Gurza ammunition is sufficiently powerful to penetrate most forms of body armor.
ID_NAME=SR-2 (9mm)
ID_SHORTNAME=SR-2
[AssaultM4]
ID_Description=A compact version of the M16 AR, the 5.56mm M4 AR is commonly used when the firepower of an assault rifle is needed, but the weight and size is not.
ID_NAME=M4 (5.56mm)
ID_SHORTNAME=M4
[AssaultG3A3]
ID_Description=The G3A3 is a standard assault rifle. It fires the powerful 7.62mm NATO round, making it both accurate and deadly.
ID_NAME=G3A3 (7.62mm)
ID_SHORTNAME=G3A3
[AssaultG36K]
ID_Description=The 5.56mm G36K AR is an extremely modern weapon. Its compact design makes it useful in close quarters, while its 5.56mm round penetrates most body armor.
ID_NAME=G36K (5.56mm)
ID_SHORTNAME=G36K
[AssaultL85A1]
ID_Description=The 5.56mm L85A1 AR is a standard infantry weapon. Its bullpup design greatly decreases its size and increases its usefulness in close quarter situations.
ID_NAME=L85A1 (5.56mm)
ID_SHORTNAME=L85A1
[AssaultAUG]
ID_Description=The 5.56mm AUG AR is a futuristic looking assault rifle with a compact bullpup design. It is well-suited for missions requiring the maneuverability of a submachine gun combined with the punch of an assault rifle.
ID_NAME=AUG (5.56mm)
ID_SHORTNAME=AUG
[AssaultM16A2]
ID_Description=When extra range or firepower is called for, RAINBOW turns to the M16A2. The M16 has proven itself over time as its 5.56mm round easily penetrates body armor.
ID_NAME=M16A2 (5.56mm)
ID_SHORTNAME=M16A2
[AssaultM14]
ID_Description=The direct descendant of the classic M1 Garand, the M14 AR fires a 7.62mm round with extreme accuracy. It entered service in 1957 and is still in use by Special Forces today.
ID_NAME=M14 (7.62mm)
ID_SHORTNAME=M14
[AssaultFAMASG2]
ID_Description=The FAMAS G2 AR fires the 5.56mm NATO round. Its rate of fire of 950 rounds per minute is the highest among RAINBOW's assault rifles.
ID_NAME=FAMAS G2 (5.56mm)
ID_SHORTNAME=FAMAS G2
[AssaultFAL]
ID_Description=The FAL it is one of the most widely used battle rifles of the 20th century. Due to its heavy recoil in full-auto mode, it's often issued in semi-auto. It uses 7.62mm NATO rounds with a magazine capacity of 20 rounds.
ID_NAME=FAL (7.62mm)
ID_SHORTNAME=FAL
[AssaultFNC]
ID_Description=Once called "The free world's assault rifle", the FNC incorporates the best ideas and characteristics of the Galil, AK and FAL. It uses 5.56mm NATO rounds with a magazine capacity of 30 rounds.
ID_NAME=FNC (5.56mm)
ID_SHORTNAME=FNC
[AssaultGalilARM]
ID_Description=The Galil is basically a recreation of the AK-47 design chambered for the NATO 5.56mm cartridge. A magazine holds 30 rounds and it has a rate of fire of 650 rounds per minute.
ID_NAME=Galil ARM (5.56mm)
ID_SHORTNAME=Galil ARM
[AssaultM82]
ID_Description=The M82 AR is based on AK/AKM internal design, but chambered in 5.56mm NATO rounds. It has a polymer frame, a magazine capacity of 30 rounds, and a rate of fire of 750 rounds per minute.
ID_NAME=M82 (5.56mm)
ID_SHORTNAME=M82
[AssaultAK47]
ID_Description=Its accuracy after the first round is questionable, but the first shot is reasonably accurate. By single and double tapping hostiles, you are sure to come out on top. Aim for the chest, and double tap. This gun is superior to most every other gun for medium-long range.
ID_NAME=AK-47 (7.62mm)
ID_SHORTNAME=AK-47
[AssaultAK74]
ID_Description=The AK-74 assault rifle comes directly from the AK-47, but is chambered for a 5.45mm round similar to the 5.56mm NATO round. When compared to the M16, the AK-74 shows slightly worse accuracy, but better reliability in battle environment and lower maintenance requirements.
ID_NAME=AK-74 (5.45mm)
ID_SHORTNAME=AK-74
[AssaultTAR21]
ID_Description=The TAR-21 is an extremely modern bullpup design and is offered in four configurations. The TAR-21 is designed as a basic infantry rifle.
ID_NAME=TAR-21 (5.56mm)
ID_SHORTNAME=TAR-21
[AssaultType97]
ID_Description=The Type 97 Assault Rifle entered service around 1997. This carbine version is specifically designed for Special Forces, police and vehicle crews.
ID_NAME=Type 97 (5.56mm)
ID_SHORTNAME=Type 97
[ShotgunM1]
ID_Description=Whether used for door breaching or highly lethal close quarters combat, a good tactical shotgun is an essential part of all anti-terrorist teams. RAINBOW uses the12g M1, largely because of its superb recoil characteristics and reliability.
ID_NAME=M1 (12g)
ID_SHORTNAME=M1
[ShotgunSPAS12]
ID_Description=The 12g SPAS-12 SG is a dual-operation shotgun with an eight-shell capacity. This weapon is ideal for quickly clearing a room.
ID_NAME=SPAS-12 (12g)
ID_SHORTNAME=SPAS-12
[ShotgunUSAS12]
ID_Description=The USAS-12 is a fully automatic shotgun based on the M16 design. Due to its weight with 20-round detachable drum magazines, the USAS-12 is said to be controllable in full automatic mode.
ID_NAME=USAS-12 (12g)
ID_SHORTNAME=USAS-12
[SniperM82A1]
ID_Description=The M82A1 SR was the first .50cal sniper rifle to achieve widespread use. Its massive length (1.55m) and weight (13.4kg) make it the largest sniper rifle in RAINBOW's arsenal. Extreme care should be used in employing this weapon, as its high-powered .50cal M33 round can tear through multiple targets just as easily as it can through an engine block.
ID_NAME=M82A1 (.50cal)
ID_SHORTNAME=M82A1
[SniperPSG1]
ID_Description=The PSG-1 is arguably the most accurate, semi-automatic sniper rifle off-the-shelf. A favorite of police forces around the world, the PSG-1 comes standard with a 6x sight and fires the NATO 7.62mm round.
ID_NAME=PSG-1 (7.62mm)
ID_SHORTNAME=PSG-1
[SniperWA2000]
ID_Description=The shortest sniper rifle used by the RAINBOW team, the WA-2000's bullpup design and light weight make it a favorite of snipers who need to move stealthily into difficult positions. Its powerful .30cal Magnum round has more punch than the more common 7.62mm NATO round.
ID_NAME=WA-2000 (.30cal)
ID_SHORTNAME=WA-2000
[SniperSSG3000]
ID_Description=The SSG-3000 is a bolt-action sniper rifle which fires the powerful 7.62mm NATO round. It is extremely accurate and has a magazine capacity of 5 rounds.
ID_NAME=SSG-3000 (7.62mm)
ID_SHORTNAME=SSG-3000
[SniperAWCovert]
ID_Description=The AW COVERT is a silenced sniper rifle firing the 7.62x51mm subsonic round. This round is less powerful than the standard 7.62x51mm round, making this rifle slightly less powerful and accurate than other sniper rifles. This reduced effectiveness is offset by the fact that the rifle is silenced by default.
ID_NAME=AW Covert (7.62mm)
ID_SHORTNAME=AW Covert
[SniperDragunov]
ID_Description=The Dragunov was designed not as a standard sniper rifle, but as a light support weapon to extend the effective range of an infantry squad up to 600 meters. As a sniper rilfe, the Dragunov is lightweight, accurate and capable of semi-auto fire. It is extremely reliable in almost all conditions.
ID_NAME=Dragunov (7.62mm)
ID_SHORTNAME=Dragunov
[SniperVSSVintorez]
ID_Description=The VSS Vintorez (Special Sniper Rifle) was designed for special operations in 1987. This rifle has an integrated sound suppressor and uses special subsonic ammo - 9mm long cartridges.
ID_NAME=VSS Vintorez (9mm)
ID_SHORTNAME=VSS Vintorez
[LMGM60E4]
ID_Description=The 7.62mm M60 LMG machine gun was designed in the late 1940's and its initial design strongly borrows from the German MG-42.  It uses 100-round belts and has a fire rate of 575 rounds per minute.
ID_NAME=M60E4 (7.62mm)
ID_SHORTNAME=M60E4
[LMGM249]
ID_Description=The 5.56 M249 LMG is a light machine gun firing the 5.56mm NATO round. It comes with a 200-round box magazine. It packs tremendous firepower, but is only accurate from a crouched stationary position. Used this way, it is an effective covering weapon.
ID_NAME=M249 (5.56mm)
ID_SHORTNAME=M249
[LMGRPD]
ID_Description=The 7.62mm RPD LMG is a light machine gun that dates back to the end of World War II. It fires the 7.62 x 39mm round from 100-round drum magazines. This weapon is less accurate than either the 5.56mm M249 or the 21E. It is lighter than either of the other two, however, and therefore returns to an accurate state after firing more rapidly.
ID_NAME=RPD (7.62mm)
ID_SHORTNAME=RPD
[LMG21E]
ID_Description=Based on the G3A3, the 21E light machine gun fires the 7.62mm NATO round from a 100-round box magazine. The 21E is more accurate than the M249, but is harder to control when moving around. As with all LMGs, this weapon is best fired from a stable firing stance.
ID_NAME=21E (7.62mm)
ID_SHORTNAME=21E
[LMG23E]
ID_Description=The 23E is similar to the 21E in almost every respect except that it is chambered to take the 5.56mm NATO round. It also has a slightly shorter barrel length.
ID_NAME=23E (5.56mm)
ID_SHORTNAME=23E
